name: "iris_classifier"
backend: "onnxruntime"

input [
    {
        name: "float_input"
        data_type: TYPE_FP32
        dims: [ -1, 4 ]
    }
]

output [
    {
        name: "label"
        data_type: TYPE_STRING
        dims: [ -1 ]
    },
    {
        name: "probabilities"
        data_type: TYPE_FP32
        dims: [ -1, 3 ]
    }
]

instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]

dynamic_batching: { max_queue_delay_microseconds: 500}
